In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.2.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("sample_employees.csv")

In [4]:
df.head(10)

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [5]:
df.columns.tolist()

['id', 'name', 'department', 'salary', 'age', 'city']

In [6]:
df.shape

(7, 6)

In [7]:
df['department'].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [8]:
df.isna().sum()

id            0
name          0
department    0
salary        1
age           1
city          0
dtype: int64

In [9]:
df1 = df[['age', 'salary']].mean()

In [10]:
df[['age', 'salary']].fillna(df1, inplace=True)
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_13416\1991877291.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['age', 'salary']].fillna(df1, inplace=True)

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [11]:
df['salary'].fillna(df['salary'].mean(), inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_13416\3850147431.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(), inplace=True)

In [12]:
df

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance  60000.0  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [13]:
df['age'].fillna(df['age'].mean(),inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_13416\1492264711.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(),inplace=True)

In [14]:
df

   id     name department   salary        age       city
0   1    Alice         HR  50000.0  25.000000      Delhi
1   2      Bob         IT  60000.0  30.000000     Mumbai
2   3  Charlie         IT  70000.0  35.000000      Delhi
3   4    David    Finance  60000.0  40.000000  Bangalore
4   5      Eva         HR  55000.0  31.333333      Delhi
5   6    Frank    Finance  65000.0  28.000000     Mumbai
6   7    Grace         IT  60000.0  30.000000     Mumbai

In [15]:
df['salary_age']=df['salary']*df['age']

In [16]:
df

   id     name department   salary        age       city    salary_age
0   1    Alice         HR  50000.0  25.000000      Delhi  1.250000e+06
1   2      Bob         IT  60000.0  30.000000     Mumbai  1.800000e+06
2   3  Charlie         IT  70000.0  35.000000      Delhi  2.450000e+06
3   4    David    Finance  60000.0  40.000000  Bangalore  2.400000e+06
4   5      Eva         HR  55000.0  31.333333      Delhi  1.723333e+06
5   6    Frank    Finance  65000.0  28.000000     Mumbai  1.820000e+06
6   7    Grace         IT  60000.0  30.000000     Mumbai  1.800000e+06

In [17]:
df1 = pd.DataFrame({
    'EmpID': [1, 2, 3, 4],
    'Name': ['A', 'B', 'C', 'D'],
    'Department': ['HR', 'IT', 'Finance', 'IT']
})

df2 = pd.DataFrame({
    'EmpID': [1, 2, 4, 5],
    'Salary': [50000, 60000, 55000, 70000]
})

# inner join

In [19]:
merge_df=pd.merge(df1,df2 , on='EmpID',how='inner')
merge_df

   EmpID Name Department  Salary
0      1    A         HR   50000
1      2    B         IT   60000
2      4    D         IT   55000

# left join

In [21]:
merge_df=pd.merge(df1,df2, on='EmpID',how='left')
merge_df

   EmpID Name Department   Salary
0      1    A         HR  50000.0
1      2    B         IT  60000.0
2      3    C    Finance      NaN
3      4    D         IT  55000.0

# right join

In [23]:
merge_df=pd.merge(df1,df2, on='EmpID',how='right')
merge_df

   EmpID Name Department  Salary
0      1    A         HR   50000
1      2    B         IT   60000
2      4    D         IT   55000
3      5  NaN        NaN   70000

# outer join

In [25]:
merge_df=pd.merge(df1,df2, on='EmpID',how='outer')
merge_df

   EmpID Name Department   Salary
0      1    A         HR  50000.0
1      2    B         IT  60000.0
2      3    C    Finance      NaN
3      4    D         IT  55000.0
4      5  NaN        NaN  70000.0

# use of group by

In [26]:
import pandas as pd

data = {'Department': ['HR', 'IT', 'Finance', 'HR', 'IT', 'Finance', 'HR'],
        'Employee':   ['A', 'B', 'C', 'D', 'E', 'F', 'G'],
        'Salary':     [50000, 60000, 55000, 52000, 65000, 58000, 51000]}

df = pd.DataFrame(data)

In [35]:
group_df=df.groupby('Department')['Salary'].mean()
print(group_df)

Department
Finance    56500.0
HR         51000.0
IT         62500.0
Name: Salary, dtype: float64

In [36]:
group_df[group_df>55000]

Department
Finance    56500.0
IT         62500.0
Name: Salary, dtype: float64

# lambda function in pandas

In [37]:
import pandas as pd

data = {'Name': ['A', 'B', 'C', 'D'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

In [40]:
df['AgeGroup'] = df['Age'].apply(lambda x: 'Young' if x < 30 else ('Mid' if x < 40 else 'Senior'))
df

  Name  Age   Salary AgeGroup
0    A   25  55000.0    Young
1    B   30  66000.0      Mid
2    C   35  77000.0      Mid
3    D   40  88000.0   Senior

In [41]:
df['Salary']=df['Salary'].apply(lambda x:x*1.10)
df

  Name  Age   Salary AgeGroup
0    A   25  60500.0    Young
1    B   30  72600.0      Mid
2    C   35  84700.0      Mid
3    D   40  96800.0   Senior